Числа - положительные и отрицательные (а ещё есть 0 — нуль, который ни положительный, ни отрицательны).

// Комбинированное присваивание 
/** += - читается как «присваивание со сложением» для того, чтобы быстро увеличить значение переменной! 
 * Это называется комбинированным присваиванием, поскольку сперва имеет место операция над переменной — 
 * собственно то, с чем комбинируется следующее затем присваивание переменной нового значения.  
 */
let ответ = 0;
undefined
ответ *= 2;
0
ответ *= 30;
0
ответ += 2;
2
ответ *= 30;
60
ответ -= 12;
48
ответ /= 6;
8
ответ *= 7 - 5;
16
ответ += ответ;
32
ответ /= 4;
8
ответ -= ответ;
0



/** Основи JavaScript - https://uk.javascript.info/operators 
* Базові оператори, математика.
*/



















